import UIKit

var greeting = "Hello, playground"
//1. Создать новый Playground
//2. Написать переменные и константы всех базовых типов данных: Int, Bool, Float,
//Double, String. У чисел вывести их минимальные и максимальные значения (Int8/16…
//UInt…), а у строки – количество символов.
//3. Написать различные выражения с приведением типа. Минимум 8 выражений.
//4. Произвести различные вычисления с математическими операторами (умножение,
//деление, сложение, вычитание). Выводить результат в консоль в таком виде: 3
//+ 2 = 5 (использовать интерполяцию строк).
//5. С помощью if-else необходимо вывести в консоль, ночь ли сегодня (isNight).
//6. Дана строка, сделать копию этой строки. Вывести копию строки в консоль. Помним,
//что строка – это коллекция символов, по которым можно "пробегаться". Решение let
//str2 = str1; print(str2) не принимается.
//7*. Сделать проверку: является ли число четным: 13, 2, 20, 21, 76.
//8*. В переменной day лежит какое-то число от 1 до 31 (вы задаете сами любое).
//Определить, в какую декаду месяца попадает это число (в первую, вторую или
//третью).
//9*. Дана строка, состоящая из символов, например, “bbppeeyy”
//. Проверить, что
//первым символом этой строки является буква “a” (или любая другая). Если это так –
//вывести 'да', в противном случае -
//‘нет’
//. Затем поменяйте строку, чтобы условие
//соблюдалось. Поэкспериментируйте с разными строками.
//10*. Вывести таблицу умножения в консоль с помощью циклов for in.
//
//Скинуть мне архив архив плейграунда в лс.
